matheusfillipe/siwaj/firmware/sdkconfig.defaults
# The main task draws the panel, and `render` returns a whole FRAME_BYTES
# framebuffer by value, so a draw costs 5K of stack before the formatting
# machinery underneath it runs. This stack is carved out of the heap, so
# overflowing it corrupts heap metadata and the failure surfaces much later
# as a crash inside malloc.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576

# Increase a bit these stack sizes as they are also a bit too small by default
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# Target
CONFIG_IDF_TARGET="esp32s3"

# V2 board: 8MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=n
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Custom partition table (factory app + nvs + nvs_key for encrypted NVS + fat
# storage). The CSV filename is injected as an absolute path by the Makefile
# (firmware-partitions target) because esp-idf resolves it against its
# generated project dir, not the crate root.
CONFIG_PARTITION_TABLE_CUSTOM=y

# Single core: the fetch-sleep loop never needs CPU1, and the QEMU fork's
# esp32s3 machine stalls booting the second core
CONFIG_FREERTOS_UNICORE=y

# TLS bundle for OpenWeather HTTPS
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# browsers send ~600B of headers; the 512 default makes the http server reject them
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
